papers/scs2010.html
---
layout: page
title: ! 'False data injection attacks in control systems'
comments: true
---
<hr />
<p>
<b>Yilin Mo and Bruno Sinopoli</b>
</p>

<p>
<i>First Workshop on Secure Control Systems, CPS Week</i>, 2010 
</p>

<p>
Link to the <a href="../../../public/papers/scs2010.pdf">paper</a>
</p>

<div id="outline-container-org193c019" class="outline-2">
<h2 id="org193c019">Abstract</h2>
<div class="outline-text-2" id="text-org193c019">
<p>
This paper analyzes the effects of false data injec-tion attacks on Control System. We assume that the system, equipped with a Kalman filter and LQG con-troller, is used to monitor and control a discrete linear time invariant Gaussian system. We further assume that the system is equipped with a failure detector. An at-tacker wishes to destabilize the system by compromising a subset of sensors and sending corrupted readings to the state estimator. In order to inject fake sensor mea-surements without being detected the attacker needs to carefully design its inputs to fool the failure detector, since abnormal sensor measurements usually trigger an alarm from the failure detector. We will provide a nec-essary and sufficient condition under which the attacker could destabilize the system while successfully bypass-ing the failure detector. A design method for the de-fender to improve the resilience of the CPS against such kind of false data injection attacks is also provided.
</p>
</div>
</div>

<div id="outline-container-org6c0bd74" class="outline-2">
<h2 id="org6c0bd74">Errata</h2>
<div class="outline-text-2" id="text-org6c0bd74">
<p>
The proof of Theorem 2 is not correct. However, the statement is correct. The sketched proof can be found <a href="../../../public/papers/scs2010-errata.pdf">here</a>.
</p>
</div>
</div>

<div id="outline-container-org0059949" class="outline-2">
<h2 id="org0059949">Code</h2>
<div class="outline-text-2" id="text-org0059949">
<p>
The <a href="../../../public/code/scs2010/simulation.m">code</a> is written in Matlab R2009b (7.9.0.529).
</p>
</div>
</div>
